ObschepitRAIPO/src/Catalogs/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Товары</name>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.НаценочныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ГруппыИзделий</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеВеса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаБлюда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Продукты</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ObschepitRAIPO/src/Catalogs/Товары/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТабличнаяЧасть = Объект.Продукты;
	Для Каждого Элемент из ТабличнаяЧасть Цикл
		Элемент.Сумма = Элемент.Цена * Элемент.Норма;
	КонецЦикла;
	Элементы.Сумма.ТекстПодвала = Объект.Продукты.Итог("Сумма");
	Объект.ЦенаБлюда = Объект.Продукты.Итог("Сумма")/100; 
КонецПроцедуры

&НаКлиенте
Процедура ПродуктыПослеУдаления(Элемент)
	Элементы.Сумма.ТекстПодвала = Объект.Продукты.Итог("Сумма");
	Объект.ЦенаБлюда = Объект.Продукты.Итог("Сумма")/100;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзменении()
	СтрокаТабличнойЧасти = Элементы.Продукты.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ОбщиеПроцедуры.ПолучитьЗначениеРеквизитаНаСервере(СтрокаТабличнойЧасти.Продукт, "Цена");
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Норма; 
	Элементы.Сумма.ТекстПодвала = Объект.Продукты.Итог("Сумма");
	Объект.ЦенаБлюда = Объект.Продукты.Итог("Сумма")/100;
КонецПроцедуры

&НаКлиенте
Процедура ПродуктПриИзменении(Элемент)
	ПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура НормаПриИзменении(Элемент)
	ПриИзменении();
КонецПроцедуры
